books/haskell-math/ch4.org
#+PROPERTY: tangle src/ch4.hs
#+SETUPFILE: ./math.orgsetup

* Book Notes
:PROPERTIES:
:HTML_CONTAINER: header
:END:

  Notes taken while reading: _The Haskell Road to Logic, Maths and
  Programming_ Second Edition, by Kees Doets and Jan van Eijck.

* Chapter 4: Sets Types and Lists

  # Tangle with C-c C-x v t   (org-babel-tangle)
  #   or with F6

  #+BEGIN_SRC haskell
    {-# LANGUAGE FlexibleInstances #-}
    module CH4 where

    import Data.List
    import DB

    main = do
      putStrLn "** Loaded **"
  #+END_SRC

  #+BEGIN_SRC haskell
    naturals = [0..]

    evens1 = [n | n <- naturals, even n]
    odds1  = [n | n <- naturals, odd n]

    evens2 = [2*n | n <- naturals]
  #+END_SRC

** Paradoxes, Types, and Type Classes

   An example program for which it cannot be proven to halt:

   #+BEGIN_SRC haskell
     run :: Integer -> [Integer]
     run n | n < 1 = error "argument not positive"
           | n == 1 = [1]
           | even n = n : run (div n 2)
           | odd n  = n : run (3*n + 1)
   #+END_SRC

