books/haskell-math/ch4.html
<!DOCTYPE html>
<html>
<head>
<title></title>
<!-- 2015-02-23 Mon 20:26 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Toby Tripp">
<link rel="stylesheet" href="/stylesheets/styles.css">
<link rel="stylesheet" href="/stylesheets/pygment_trac.css">
<meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
</head>
<body>
<div id="wrapper">
<h1 class="title"></h1>

<header id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Book Notes</h2>
<div class="outline-text-2" id="text-1">

<p>
Notes taken while reading: <span class="underline">The Haskell Road to Logic, Maths and
Programming</span> Second Edition, by Kees Doets and Jan van Eijck.
</p>
</div>
</header>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Chapter 4: Sets Types and Lists</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #586e75;">{-# LANGUAGE FlexibleInstances #-}</span>
<span style="color: #859900; font-weight: bold;">module</span> <span style="color: #b58900;">CH4</span> <span style="color: #859900; font-weight: bold;">where</span>

<span style="color: #859900; font-weight: bold;">import</span> <span style="color: #b58900;">Data.List</span>
<span style="color: #859900; font-weight: bold;">import</span> <span style="color: #b58900;">DB</span>

<span style="color: #268bd2;">main</span> <span style="color: #268bd2;">=</span> <span style="color: #859900; font-weight: bold;">do</span>
  putStrLn <span style="color: #2aa198;">"** Loaded **"</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">naturals</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span>0<span style="color: #268bd2;">..</span><span style="color: #f5deb3;">]</span>

<span style="color: #268bd2;">evens1</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span>n <span style="color: #268bd2;">|</span> n <span style="color: #268bd2;">&lt;-</span> naturals, even n<span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">odds1</span>  <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span>n <span style="color: #268bd2;">|</span> n <span style="color: #268bd2;">&lt;-</span> naturals, odd n<span style="color: #f5deb3;">]</span>

<span style="color: #268bd2;">evens2</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span>2<span style="color: #268bd2;">*</span>n <span style="color: #268bd2;">|</span> n <span style="color: #268bd2;">&lt;-</span> naturals<span style="color: #f5deb3;">]</span>
</pre>
</div>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Paradoxes, Types, and Type Classes</h3>
<div class="outline-text-3" id="text-2-1">
<p>
An example program for which it cannot be proven to halt:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">run</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Integer</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">Integer</span><span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">run</span> n <span style="color: #268bd2;">|</span> n <span style="color: #268bd2;">&lt;</span> 1 <span style="color: #268bd2;">=</span> error <span style="color: #2aa198;">"argument not positive"</span>
      <span style="color: #268bd2;">|</span> n <span style="color: #268bd2;">==</span> 1 <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span>1<span style="color: #f5deb3;">]</span>
      <span style="color: #268bd2;">|</span> even n <span style="color: #268bd2;">=</span> n <span style="color: #b58900;">:</span> run <span style="color: #f5deb3;">(</span>div n 2<span style="color: #f5deb3;">)</span>
      <span style="color: #268bd2;">|</span> odd n  <span style="color: #268bd2;">=</span> n <span style="color: #b58900;">:</span> run <span style="color: #f5deb3;">(</span>3<span style="color: #268bd2;">*</span>n <span style="color: #268bd2;">+</span> 1<span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>
