books/haskell-math/ch4.html

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">List Comprehensions</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Defining a database type, <code>DB</code>:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #859900; font-weight: bold;">module</span> <span style="color: #b58900;">DB</span> <span style="color: #859900; font-weight: bold;">where</span>
<span style="color: #859900; font-weight: bold;">type</span> <span style="color: #b58900;">WordList</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">String</span><span style="color: #f5deb3;">]</span>
<span style="color: #859900; font-weight: bold;">type</span> <span style="color: #b58900;">DB</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">WordList</span><span style="color: #f5deb3;">]</span>

<span style="color: #268bd2;">db</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">DB</span>
<span style="color: #268bd2;">db</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span>
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Romeo"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Jack Dawson"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Sean McGuire"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Vincent Vega"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Mr White"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Winston Wolf"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Mia"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Juliet"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Jimmie"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Mr Brown"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Dallas"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Ellen Ripley"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Bishop"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Deckard"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Rachael"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Roy Batty"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Vito Corleone"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Michael Corleone"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Tom Hagen"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"William Somerset"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"David Mills"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Louise"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Thelma"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Max Cady"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Will Hunting"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Sam Bowden"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Leigh Bowden"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Danielle Bowden"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"John Doe"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Verbal Kint"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Dean Keaton"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"John Murdoch"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Frank Bumstead"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Doctor Schreber"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"James Cole"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Kathryn Railly"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Jeffrey Goines"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"John McClane"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Hans Gruber"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Hannibal Lecter"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Clarice Starling"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Castor Troy"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Sean Archer"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Mark Renton"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Francis Begbie"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Sidney Prescott"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Gale Weathers"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Billy Loomis"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Ben Sanderson"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Sera"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Marge Gunderson"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Carl Showalter"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Ethan Hunt"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Jim Phelps"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Claire Phelps"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Vincent Freeman"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Irene Cassini"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Indiana Jones"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Sallah"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Marion Ravenwood"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Richard Kimble"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Samuel Gerard"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Charles Nichols"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Kay"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Jay"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Laurel"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Mr Pink"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Eliot Ness"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Jim Malone"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"George Stone"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Al Capone"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Rose DeWit Bukater"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Connor MacLeod"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Ramirez"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Colonel Kurtz"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Captain Willard"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Lieutenant Kilgore"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Gordon Gekko"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Bud Fox"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Carl Fox"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Chris"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Big Harold"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"character"</span>, <span style="color: #2aa198;">"Sgt. Barnes"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Apocalypse Now"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"The Untouchables"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Men in Black"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Raiders of the Lost Ark"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Gattaca"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"The Fugitive"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Blade Runner"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Alien"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Aliens"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Titanic"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Good Will Hunting"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Pulp Fiction"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Reservoir Dogs"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Romeo and Juliet"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"The Godfather"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"The Godfather II"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Seven"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Thelma and Louise"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Cape Fear"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"The Usual Suspects"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Dark City"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Die Hard"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Silence of the Lambs"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Face/Off"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Trainspotting"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Scream"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Leaving Las Vegas"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Fargo"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Mission Impossible"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Twelve Monkeys"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Highlander"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Wall Street"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"movie"</span>, <span style="color: #2aa198;">"Platoon"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Andy Garcia"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Sean Connery"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Kevin Costner"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"John Rhys-Davies"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Karen Allen"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Tommy Lee Jones"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Jeroen Krabbe"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Will Smith"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Linda Fiorentino"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Ethan Hawke"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Leonardo DiCaprio"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"John Travolta"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Robin Williams"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Harvey Keitel"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Quentin Tarantino"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Lance Henriksen"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Tom Skerritt"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Rutger Hauer"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Harrison Ford"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Marlon Brando"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Al Pacino"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Robert Duvall"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Morgan Freeman"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Brad Pitt"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Robert De Niro"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Claire Danes"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Uma Thurman"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Sigourney Weaver"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Sean Young"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Susan Sarandon"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Geena Davis"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Matt Damon"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Nick Nolte"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Jessica Lange"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Juliette Lewis"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Kevin Spacey"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Gabriel Byrne"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Rufus Sewell"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"William Hurt"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Kiefer Sutherland"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Bruce Willis"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Alan Rickman"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Anthony Hopkins"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Jodie Foster"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Nicolas Cage"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Ewan McGregor"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Robert Carlyle"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Neve Campbell"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Courteney Cox"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Skeet Ulrich"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Elisabeth Shue"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Frances McDormand"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Steve Buscemi"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Tom Cruise"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Jon Voight"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Emmanuelle Beart"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Madeleine Stowe"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Christopher Lambert"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Martin Sheen"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Charlie Sheen"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Michael Douglas"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Forest Whitaker"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"actor"</span>, <span style="color: #2aa198;">"Tom Berenger"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"Andrew Niccol"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"Barry Sonnenfeld"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"Andrew Davis"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"Steven Spielberg"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"James Cameron"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"Ridley Scott"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"Gus Van Sant"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"Baz Luhrmann"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"Francis Ford Coppola"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"David Fincher"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"Martin Scorsese"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"Bryan Singer"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"Alex Proyas"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"John McTiernan"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"Jonathan Demme"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"John Woo"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"Danny Boyle"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"Wes Craven"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"Mike Figgis"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"Brian De Palma"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"Joel Coen"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"Terry Gilliam"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"Russell Mulcahy"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"director"</span>, <span style="color: #2aa198;">"Oliver Stone"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Blade Runner"</span>, <span style="color: #2aa198;">"1982"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Alien"</span>, <span style="color: #2aa198;">"1979"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Aliens"</span>, <span style="color: #2aa198;">"1986"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Titanic"</span>, <span style="color: #2aa198;">"1997"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Good Will Hunting"</span>, <span style="color: #2aa198;">"1997"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Pulp Fiction"</span>, <span style="color: #2aa198;">"1994"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Reservoir Dogs"</span>, <span style="color: #2aa198;">"1992"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Romeo and Juliet"</span>, <span style="color: #2aa198;">"1996"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"The Godfather"</span>, <span style="color: #2aa198;">"1972"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"The Godfather II"</span>, <span style="color: #2aa198;">"1974"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Seven"</span>, <span style="color: #2aa198;">"1995"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Thelma and Louise"</span>, <span style="color: #2aa198;">"1991"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Cape Fear"</span>, <span style="color: #2aa198;">"1991"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"The Usual Suspects"</span>, <span style="color: #2aa198;">"1995"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Dark City"</span>, <span style="color: #2aa198;">"1998"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Die Hard"</span>, <span style="color: #2aa198;">"1988"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Face/Off"</span>, <span style="color: #2aa198;">"1997"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Silence of the Lambs"</span>, <span style="color: #2aa198;">"1991"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Trainspotting"</span>, <span style="color: #2aa198;">"1996"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Scream"</span>, <span style="color: #2aa198;">"1996"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Leaving Las Vegas"</span>, <span style="color: #2aa198;">"1995"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Fargo"</span>, <span style="color: #2aa198;">"1996"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Mission Impossible"</span>, <span style="color: #2aa198;">"1996"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Twelve Monkeys"</span>, <span style="color: #2aa198;">"1995"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Gattaca"</span>, <span style="color: #2aa198;">"1997"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Raiders of the Lost Ark"</span>, <span style="color: #2aa198;">"1981"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"The Fugitive"</span>, <span style="color: #2aa198;">"1993"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Men in Black"</span>, <span style="color: #2aa198;">"1997"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"The Untouchables"</span>, <span style="color: #2aa198;">"1987"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Highlander"</span>, <span style="color: #2aa198;">"1986"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Apocalypse Now"</span>, <span style="color: #2aa198;">"1979"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Wall Street"</span>, <span style="color: #2aa198;">"1987"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"Platoon"</span>, <span style="color: #2aa198;">"1986"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #2aa198;">"The Truman Show"</span>, <span style="color: #2aa198;">"1998"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Brian De Palma"</span>, <span style="color: #2aa198;">"The Untouchables"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"James Cameron"</span>, <span style="color: #2aa198;">"Titanic"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"James Cameron"</span>, <span style="color: #2aa198;">"Aliens"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Ridley Scott"</span>, <span style="color: #2aa198;">"Alien"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Ridley Scott"</span>, <span style="color: #2aa198;">"Blade Runner"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Ridley Scott"</span>, <span style="color: #2aa198;">"Thelma and Louise"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Gus Van Sant"</span>, <span style="color: #2aa198;">"Good Will Hunting"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Quentin Tarantino"</span>, <span style="color: #2aa198;">"Pulp Fiction"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Quentin Tarantino"</span>, <span style="color: #2aa198;">"Reservoir Dogs"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Baz Luhrmann"</span>, <span style="color: #2aa198;">"Romeo and Juliet"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Francis Ford Coppola"</span>, <span style="color: #2aa198;">"The Godfather"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Francis Ford Coppola"</span>, <span style="color: #2aa198;">"The Godfather II"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"David Fincher"</span>, <span style="color: #2aa198;">"Seven"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Martin Scorsese"</span>, <span style="color: #2aa198;">"Cape Fear"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Bryan Singer"</span>, <span style="color: #2aa198;">"The Usual Suspects"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Alex Proyas"</span>, <span style="color: #2aa198;">"Dark City"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"John McTiernan"</span>, <span style="color: #2aa198;">"Die Hard"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Jonathan Demme"</span>, <span style="color: #2aa198;">"Silence of the Lambs"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"John Woo"</span>, <span style="color: #2aa198;">"Face/Off"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Danny Boyle"</span>, <span style="color: #2aa198;">"Trainspotting"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Wes Craven"</span>, <span style="color: #2aa198;">"Scream"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Mike Figgis"</span>, <span style="color: #2aa198;">"Leaving Las Vegas"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Joel Coen"</span>, <span style="color: #2aa198;">"Fargo"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Brian De Palma"</span>, <span style="color: #2aa198;">"Mission Impossible"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Terry Gilliam"</span>, <span style="color: #2aa198;">"Twelve Monkeys"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Andrew Niccol"</span>, <span style="color: #2aa198;">"Gattaca"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Steven Spielberg"</span>, <span style="color: #2aa198;">"Raiders of the Lost Ark"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Andrew Davis"</span>, <span style="color: #2aa198;">"The Fugitive"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Barry Sonnenfeld"</span>, <span style="color: #2aa198;">"Men in Black"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Russell Mulcahy"</span>, <span style="color: #2aa198;">"Highlander"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Francis Ford Coppola"</span>, <span style="color: #2aa198;">"Apocalypse Now"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Oliver Stone"</span>, <span style="color: #2aa198;">"Wall Street"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, <span style="color: #2aa198;">"Oliver Stone"</span>, <span style="color: #2aa198;">"Platoon"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Leonardo DiCaprio"</span>, <span style="color: #2aa198;">"Romeo and Juliet"</span>, <span style="color: #2aa198;">"Romeo"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Leonardo DiCaprio"</span>, <span style="color: #2aa198;">"Titanic"</span>, <span style="color: #2aa198;">"Jack Dawson"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Robin Williams"</span>, <span style="color: #2aa198;">"Good Will Hunting"</span>, <span style="color: #2aa198;">"Sean McGuire"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"John Travolta"</span>, <span style="color: #2aa198;">"Pulp Fiction"</span>, <span style="color: #2aa198;">"Vincent Vega"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Harvey Keitel"</span>, <span style="color: #2aa198;">"Reservoir Dogs"</span>, <span style="color: #2aa198;">"Mr White"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Harvey Keitel"</span>, <span style="color: #2aa198;">"Pulp Fiction"</span>, <span style="color: #2aa198;">"Winston Wolf"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Uma Thurman"</span>, <span style="color: #2aa198;">"Pulp Fiction"</span>, <span style="color: #2aa198;">"Mia"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Quentin Tarantino"</span>, <span style="color: #2aa198;">"Pulp Fiction"</span>, <span style="color: #2aa198;">"Jimmie"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Quentin Tarantino"</span>, <span style="color: #2aa198;">"Reservoir Dogs"</span>, <span style="color: #2aa198;">"Mr Brown"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Sigourney Weaver"</span>, <span style="color: #2aa198;">"Alien"</span>, <span style="color: #2aa198;">"Ellen Ripley"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Sigourney Weaver"</span>, <span style="color: #2aa198;">"Aliens"</span>, <span style="color: #2aa198;">"Ellen Ripley"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Lance Henriksen"</span>, <span style="color: #2aa198;">"Aliens"</span>, <span style="color: #2aa198;">"Bishop"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Tom Skerritt"</span>, <span style="color: #2aa198;">"Alien"</span>, <span style="color: #2aa198;">"Dallas"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Harrison Ford"</span>, <span style="color: #2aa198;">"Blade Runner"</span>, <span style="color: #2aa198;">"Deckard"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Rutger Hauer"</span>, <span style="color: #2aa198;">"Blade Runner"</span>, <span style="color: #2aa198;">"Roy Batty"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Sean Young"</span>, <span style="color: #2aa198;">"Blade Runner"</span>, <span style="color: #2aa198;">"Rachael"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Marlon Brando"</span>, <span style="color: #2aa198;">"The Godfather"</span>, <span style="color: #2aa198;">"Vito Corleone"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Al Pacino"</span>, <span style="color: #2aa198;">"The Godfather"</span>, <span style="color: #2aa198;">"Michael Corleone"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Robert Duvall"</span>, <span style="color: #2aa198;">"The Godfather"</span>, <span style="color: #2aa198;">"Tom Hagen"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Morgan Freeman"</span>, <span style="color: #2aa198;">"Seven"</span>, <span style="color: #2aa198;">"William Somerset"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Brad Pitt"</span>, <span style="color: #2aa198;">"Seven"</span>, <span style="color: #2aa198;">"David Mills"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Robert De Niro"</span>, <span style="color: #2aa198;">"The Godfather II"</span>, <span style="color: #2aa198;">"Vito Corleone"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Al Pacino"</span>, <span style="color: #2aa198;">"The Godfather II"</span>, <span style="color: #2aa198;">"Michael Corleone"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Robert Duvall"</span>, <span style="color: #2aa198;">"The Godfather II"</span>, <span style="color: #2aa198;">"Tom Hagen"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Susan Sarandon"</span>, <span style="color: #2aa198;">"Thelma and Louise"</span>, <span style="color: #2aa198;">"Louise"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Geena Davis"</span>, <span style="color: #2aa198;">"Thelma and Louise"</span>, <span style="color: #2aa198;">"Thelma"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Robert De Niro"</span>, <span style="color: #2aa198;">"Cape Fear"</span>, <span style="color: #2aa198;">"Max Cady"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Matt Damon"</span>, <span style="color: #2aa198;">"Good Will Hunting"</span>, <span style="color: #2aa198;">"Will Hunting"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Nick Nolte"</span>, <span style="color: #2aa198;">"Cape Fear"</span>, <span style="color: #2aa198;">"Sam Bowden"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Jessica Lange"</span>, <span style="color: #2aa198;">"Cape Fear"</span>, <span style="color: #2aa198;">"Leigh Bowden"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Juliette Lewis"</span>, <span style="color: #2aa198;">"Cape Fear"</span>, <span style="color: #2aa198;">"Danielle Bowden"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Kevin Spacey"</span>, <span style="color: #2aa198;">"Seven"</span>, <span style="color: #2aa198;">"John Doe"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Kevin Spacey"</span>, <span style="color: #2aa198;">"The Usual Suspects"</span>, <span style="color: #2aa198;">"Verbal Kint"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Gabriel Byrne"</span>, <span style="color: #2aa198;">"The Usual Suspects"</span>, <span style="color: #2aa198;">"Dean Keaton"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Rufus Sewell"</span>, <span style="color: #2aa198;">"Dark City"</span>, <span style="color: #2aa198;">"John Murdoch"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"William Hurt"</span>, <span style="color: #2aa198;">"Dark City"</span>, <span style="color: #2aa198;">"Frank Bumstead"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Kiefer Sutherland"</span>, <span style="color: #2aa198;">"Dark City"</span>, <span style="color: #2aa198;">"Doctor Schreber"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Bruce Willis"</span>, <span style="color: #2aa198;">"Die Hard"</span>, <span style="color: #2aa198;">"John McClane"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Alan Rickman"</span>, <span style="color: #2aa198;">"Die Hard"</span>, <span style="color: #2aa198;">"Hans Gruber"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Anthony Hopkins"</span>, <span style="color: #2aa198;">"Silence of the Lambs"</span>, <span style="color: #2aa198;">"Hannibal Lecter"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Jodie Foster"</span>, <span style="color: #2aa198;">"Silence of the Lambs"</span>, <span style="color: #2aa198;">"Clarice Starling"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Nicolas Cage"</span>, <span style="color: #2aa198;">"Face/Off"</span>, <span style="color: #2aa198;">"Castor Troy"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"John Travolta"</span>, <span style="color: #2aa198;">"Face/Off"</span>, <span style="color: #2aa198;">"Sean Archer"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Ewan McGregor"</span>, <span style="color: #2aa198;">"Trainspotting"</span>, <span style="color: #2aa198;">"Mark Renton"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Robert Carlyle"</span>, <span style="color: #2aa198;">"Trainspotting"</span>, <span style="color: #2aa198;">"Francis Begbie"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Neve Campbell"</span>, <span style="color: #2aa198;">"Scream"</span>, <span style="color: #2aa198;">"Sidney Prescott"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Courteney Cox"</span>, <span style="color: #2aa198;">"Scream"</span>, <span style="color: #2aa198;">"Gale Weathers"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Skeet Ulrich"</span>, <span style="color: #2aa198;">"Scream"</span>, <span style="color: #2aa198;">"Billy Loomis"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Nicolas Cage"</span>, <span style="color: #2aa198;">"Leaving Las Vegas"</span>, <span style="color: #2aa198;">"Ben Sanderson"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Elisabeth Shue"</span>, <span style="color: #2aa198;">"Leaving Las Vegas"</span>, <span style="color: #2aa198;">"Sera"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Frances McDormand"</span>, <span style="color: #2aa198;">"Fargo"</span>, <span style="color: #2aa198;">"Marge Gunderson"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Steve Buscemi"</span>, <span style="color: #2aa198;">"Fargo"</span>, <span style="color: #2aa198;">"Carl Showalter"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Tom Cruise"</span>, <span style="color: #2aa198;">"Mission Impossible"</span>, <span style="color: #2aa198;">"Ethan Hunt"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Jon Voight"</span>, <span style="color: #2aa198;">"Mission Impossible"</span>, <span style="color: #2aa198;">"Jim Phelps"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Emmanuelle Beart"</span>, <span style="color: #2aa198;">"Mission Impossible"</span>, <span style="color: #2aa198;">"Claire Phelps"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Bruce Willis"</span>, <span style="color: #2aa198;">"Twelve Monkeys"</span>, <span style="color: #2aa198;">"James Cole"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Madeleine Stowe"</span>, <span style="color: #2aa198;">"Twelve Monkeys"</span>, <span style="color: #2aa198;">"Kathryn Railly"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Brad Pitt"</span>, <span style="color: #2aa198;">"Twelve Monkeys"</span>, <span style="color: #2aa198;">"Jeffrey Goines"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Ethan Hawke"</span>, <span style="color: #2aa198;">"Gattaca"</span>, <span style="color: #2aa198;">"Vincent Freeman"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Uma Thurman"</span>, <span style="color: #2aa198;">"Gattaca"</span>, <span style="color: #2aa198;">"Irene Cassini"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Steve Buscemi"</span>, <span style="color: #2aa198;">"Reservoir Dogs"</span>, <span style="color: #2aa198;">"Mr Pink"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Harrison Ford"</span>, <span style="color: #2aa198;">"Raiders of the Lost Ark"</span>, <span style="color: #2aa198;">"Indiana Jones"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"John Rhys-Davies"</span>, <span style="color: #2aa198;">"Raiders of the Lost Ark"</span>, <span style="color: #2aa198;">"Sallah"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Karen Allen"</span>, <span style="color: #2aa198;">"Raiders of the Lost Ark"</span>, <span style="color: #2aa198;">"Marion Ravenwood"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Harrison Ford"</span>, <span style="color: #2aa198;">"The Fugitive"</span>, <span style="color: #2aa198;">"Richard Kimble"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Tommy Lee Jones"</span>, <span style="color: #2aa198;">"The Fugitive"</span>, <span style="color: #2aa198;">"Samuel Gerard"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Jeroen Krabbe"</span>, <span style="color: #2aa198;">"The Fugitive"</span>, <span style="color: #2aa198;">"Charles Nichols"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Tommy Lee Jones"</span>, <span style="color: #2aa198;">"Men in Black"</span>, <span style="color: #2aa198;">"Kay"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Will Smith"</span>, <span style="color: #2aa198;">"Men in Black"</span>, <span style="color: #2aa198;">"Jay"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Linda Fiorentino"</span>, <span style="color: #2aa198;">"Men in Black"</span>, <span style="color: #2aa198;">"Laurel"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Kevin Costner"</span>, <span style="color: #2aa198;">"The Untouchables"</span>, <span style="color: #2aa198;">"Eliot Ness"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Sean Connery"</span>, <span style="color: #2aa198;">"The Untouchables"</span>, <span style="color: #2aa198;">"Jim Malone"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Andy Garcia"</span>, <span style="color: #2aa198;">"The Untouchables"</span>, <span style="color: #2aa198;">"George Stone"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Robert De Niro"</span>, <span style="color: #2aa198;">"The Untouchables"</span>, <span style="color: #2aa198;">"Al Capone"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Kate Winslet"</span>, <span style="color: #2aa198;">"Titanic"</span>, <span style="color: #2aa198;">"Rose DeWit Bukater"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Christopher Lambert"</span>,<span style="color: #2aa198;">"Highlander"</span>, <span style="color: #2aa198;">"Connor MacLeod"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Sean Connery"</span>, <span style="color: #2aa198;">"Highlander"</span>, <span style="color: #2aa198;">"Ramirez"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Marlon Brando"</span>, <span style="color: #2aa198;">"Apocalypse Now"</span>, <span style="color: #2aa198;">"Colonel Kurtz"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Robert Duvall"</span>, <span style="color: #2aa198;">"Apocalypse Now"</span>, <span style="color: #2aa198;">"Lieutenant Kilgore"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Martin Sheen"</span>, <span style="color: #2aa198;">"Apocalypse Now"</span>, <span style="color: #2aa198;">"Captain Willard"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Michael Douglas"</span>, <span style="color: #2aa198;">"Wall Street"</span>, <span style="color: #2aa198;">"Gordon Gekko"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Charlie Sheen"</span>, <span style="color: #2aa198;">"Wall Street"</span>, <span style="color: #2aa198;">"Bud Fox"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Martin Sheen"</span>, <span style="color: #2aa198;">"Wall Street"</span>, <span style="color: #2aa198;">"Carl Fox"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Charlie Sheen"</span>, <span style="color: #2aa198;">"Platoon"</span>, <span style="color: #2aa198;">"Chris"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Forest Whitaker"</span>, <span style="color: #2aa198;">"Platoon"</span>, <span style="color: #2aa198;">"Big Haplayd"</span><span style="color: #b58900;">]</span>,
  <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #2aa198;">"Tom Berenger"</span>, <span style="color: #2aa198;">"Platoon"</span>, <span style="color: #2aa198;">"Sgt. Barnes"</span><span style="color: #b58900;">]</span>
  <span style="color: #f5deb3;">]</span>
</pre>
</div>

<p>
Database objects defined in terms of list comprehensions:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">characters</span> <span style="color: #268bd2;">=</span> nub <span style="color: #f5deb3;">[</span>x <span style="color: #268bd2;">|</span> <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, <span style="color: #859900; font-weight: bold;">_</span>, <span style="color: #859900; font-weight: bold;">_</span>, x<span style="color: #b58900;">]</span> <span style="color: #268bd2;">&lt;-</span> db<span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">movies</span>     <span style="color: #268bd2;">=</span>     <span style="color: #f5deb3;">[</span>x <span style="color: #268bd2;">|</span> <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, x, <span style="color: #859900; font-weight: bold;">_</span><span style="color: #b58900;">]</span> <span style="color: #268bd2;">&lt;-</span> db<span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">actors</span>     <span style="color: #268bd2;">=</span> nub <span style="color: #f5deb3;">[</span>x <span style="color: #268bd2;">|</span> <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, x, <span style="color: #859900; font-weight: bold;">_</span>, <span style="color: #859900; font-weight: bold;">_</span><span style="color: #b58900;">]</span> <span style="color: #268bd2;">&lt;-</span> db<span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">directors</span>  <span style="color: #268bd2;">=</span> nub <span style="color: #f5deb3;">[</span>x <span style="color: #268bd2;">|</span> <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, x, <span style="color: #859900; font-weight: bold;">_</span><span style="color: #b58900;">]</span> <span style="color: #268bd2;">&lt;-</span> db<span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">dates</span>      <span style="color: #268bd2;">=</span> nub <span style="color: #f5deb3;">[</span>x <span style="color: #268bd2;">|</span> <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, <span style="color: #859900; font-weight: bold;">_</span>, x<span style="color: #b58900;">]</span> <span style="color: #268bd2;">&lt;-</span> db<span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">universe</span>   <span style="color: #268bd2;">=</span> nub <span style="color: #f5deb3;">(</span>characters <span style="color: #268bd2;">++</span> actors <span style="color: #268bd2;">++</span> directors <span style="color: #268bd2;">++</span> movies <span style="color: #268bd2;">++</span> dates<span style="color: #f5deb3;">)</span>
</pre>
</div>

<p>
Define lists of tuples:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">direct</span>     <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">(</span>x, y<span style="color: #b58900;">)</span> <span style="color: #268bd2;">|</span> <span style="color: #b58900;">[</span><span style="color: #2aa198;">"direct"</span>, x, y<span style="color: #b58900;">]</span> <span style="color: #268bd2;">&lt;-</span> db<span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">act</span>        <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">(</span>x, y<span style="color: #b58900;">)</span> <span style="color: #268bd2;">|</span> <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, x, y, <span style="color: #859900; font-weight: bold;">_</span><span style="color: #b58900;">]</span> <span style="color: #268bd2;">&lt;-</span> db<span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">play</span>       <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">(</span>x, y, z<span style="color: #b58900;">)</span> <span style="color: #268bd2;">|</span> <span style="color: #b58900;">[</span><span style="color: #2aa198;">"play"</span>, x, y, z<span style="color: #b58900;">]</span> <span style="color: #268bd2;">&lt;-</span> db<span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">release</span>    <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">(</span>x, y<span style="color: #b58900;">)</span> <span style="color: #268bd2;">|</span> <span style="color: #b58900;">[</span><span style="color: #2aa198;">"release"</span>, x, y<span style="color: #b58900;">]</span> <span style="color: #268bd2;">&lt;-</span> db<span style="color: #f5deb3;">]</span>
</pre>
</div>

<p>
Predicates
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">charP</span>     <span style="color: #268bd2;">=</span> <span style="color: #268bd2;">\</span> x <span style="color: #268bd2;">-&gt;</span> elem x characters
<span style="color: #268bd2;">actorP</span>    <span style="color: #268bd2;">=</span> <span style="color: #268bd2;">\</span> x <span style="color: #268bd2;">-&gt;</span> elem x actors
<span style="color: #268bd2;">movieP</span>    <span style="color: #268bd2;">=</span> <span style="color: #268bd2;">\</span> x <span style="color: #268bd2;">-&gt;</span> elem x movies
<span style="color: #268bd2;">directorP</span> <span style="color: #268bd2;">=</span> <span style="color: #268bd2;">\</span> x <span style="color: #268bd2;">-&gt;</span> elem x directors
<span style="color: #268bd2;">dateP</span>     <span style="color: #268bd2;">=</span> <span style="color: #268bd2;">\</span> x <span style="color: #268bd2;">-&gt;</span> elem x dates
<span style="color: #268bd2;">actP</span>      <span style="color: #268bd2;">=</span> <span style="color: #268bd2;">\</span> <span style="color: #f5deb3;">(</span>x, y<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">-&gt;</span> elem <span style="color: #f5deb3;">(</span>x, y<span style="color: #f5deb3;">)</span> act
<span style="color: #268bd2;">releaseP</span>  <span style="color: #268bd2;">=</span> <span style="color: #268bd2;">\</span> <span style="color: #f5deb3;">(</span>x, y<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">-&gt;</span> elem <span style="color: #f5deb3;">(</span>x, y<span style="color: #f5deb3;">)</span> release
<span style="color: #268bd2;">directP</span>   <span style="color: #268bd2;">=</span> <span style="color: #268bd2;">\</span> <span style="color: #f5deb3;">(</span>x, y<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">-&gt;</span> elem <span style="color: #f5deb3;">(</span>x, y<span style="color: #f5deb3;">)</span> direct
<span style="color: #268bd2;">playP</span>     <span style="color: #268bd2;">=</span> <span style="color: #268bd2;">\</span> <span style="color: #f5deb3;">(</span>x, y, z<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">-&gt;</span> elem <span style="color: #f5deb3;">(</span>x, y, z<span style="color: #f5deb3;">)</span> play
</pre>
</div>

<p>
Now, a query:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">actorsThatAreDirectors</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span>x <span style="color: #268bd2;">|</span> x <span style="color: #268bd2;">&lt;-</span> actors, directorP x<span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">withActedFilms</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">(</span>x, y<span style="color: #b58900;">)</span> <span style="color: #268bd2;">|</span> <span style="color: #b58900;">(</span>x, y<span style="color: #b58900;">)</span> <span style="color: #268bd2;">&lt;-</span> act, directorP x<span style="color: #f5deb3;">]</span>
</pre>
</div>

<p>
This query, because the given =y=s are not related, will generate an infinite list.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">directorsFilmsReleaseDate</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">(</span>x, y, z<span style="color: #b58900;">)</span> <span style="color: #268bd2;">|</span> <span style="color: #b58900;">(</span>x, y<span style="color: #b58900;">)</span> <span style="color: #268bd2;">&lt;-</span> direct, <span style="color: #b58900;">(</span>y, z<span style="color: #b58900;">)</span> <span style="color: #268bd2;">&lt;-</span> release<span style="color: #f5deb3;">]</span>
</pre>
</div>

<p>
Fix with an equality predicate:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">directorsFilmsReleaseDate'</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">(</span>x, y, z<span style="color: #b58900;">)</span> <span style="color: #268bd2;">|</span> <span style="color: #b58900;">(</span>x, y<span style="color: #b58900;">)</span> <span style="color: #268bd2;">&lt;-</span> direct, <span style="color: #b58900;">(</span>u, z<span style="color: #b58900;">)</span> <span style="color: #268bd2;">&lt;-</span> release, y <span style="color: #268bd2;">==</span> u<span style="color: #f5deb3;">]</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">all1995Directors</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">(</span>x, y<span style="color: #b58900;">)</span> <span style="color: #268bd2;">|</span> <span style="color: #b58900;">(</span>x, y<span style="color: #b58900;">)</span> <span style="color: #268bd2;">&lt;-</span> direct, <span style="color: #b58900;">(</span>u, <span style="color: #2aa198;">"1995"</span><span style="color: #b58900;">)</span> <span style="color: #268bd2;">&lt;-</span> release, y <span style="color: #268bd2;">==</span> u<span style="color: #f5deb3;">]</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #268bd2;">directorsAfter1995</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">(</span>x, y, z<span style="color: #b58900;">)</span> <span style="color: #268bd2;">|</span> <span style="color: #b58900;">(</span>x, y<span style="color: #b58900;">)</span> <span style="color: #268bd2;">&lt;-</span> direct, <span style="color: #b58900;">(</span>u, z<span style="color: #b58900;">)</span> <span style="color: #268bd2;">&lt;-</span> release, y <span style="color: #268bd2;">==</span> u, z <span style="color: #268bd2;">&gt;</span> <span style="color: #2aa198;">"1995"</span><span style="color: #f5deb3;">]</span>
</pre>
</div>
</div>
</div>
