books/haskell-math/ch4.html


<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">A Data Type for Sets</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #859900; font-weight: bold;">module</span> <span style="color: #b58900;">SetEq</span>
    <span style="color: #f5deb3;">(</span> <span style="color: #b58900;">Set</span><span style="color: #b58900;">(</span><span style="color: #268bd2;">..</span><span style="color: #b58900;">)</span>, emptySet, isEmpty, inSet, subSet, insertSet, deleteSet, powerSet, takeSet, list2set, <span style="color: #b58900;">(</span><span style="color: #268bd2;">!!!</span><span style="color: #b58900;">)</span>
    <span style="color: #f5deb3;">)</span> <span style="color: #859900; font-weight: bold;">where</span>

<span style="color: #859900; font-weight: bold;">import</span> <span style="color: #b58900;">Data.List</span> <span style="color: #f5deb3;">(</span>delete<span style="color: #f5deb3;">)</span>

<span style="color: #859900; font-weight: bold;">infixl</span> 9 <span style="color: #268bd2;">!!!</span>

<span style="color: #859900; font-weight: bold;">newtype</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">[</span>a<span style="color: #f5deb3;">]</span>

<span style="color: #859900; font-weight: bold;">instance</span> <span style="color: #b58900;">Eq</span> a <span style="color: #268bd2;">=&gt;</span> <span style="color: #b58900;">Eq</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> a<span style="color: #f5deb3;">)</span> <span style="color: #859900; font-weight: bold;">where</span>
  set1 <span style="color: #268bd2;">==</span> set2 <span style="color: #268bd2;">=</span> subSet set1 set2 <span style="color: #268bd2;">&amp;&amp;</span> subSet set2 set1

<span style="color: #859900; font-weight: bold;">instance</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Show</span> a<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=&gt;</span> <span style="color: #b58900;">Show</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> a<span style="color: #f5deb3;">)</span> <span style="color: #859900; font-weight: bold;">where</span>
  showsPrec <span style="color: #859900; font-weight: bold;">_</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> s<span style="color: #f5deb3;">)</span> str <span style="color: #268bd2;">=</span> showSet s str

<span style="color: #268bd2;">showSet</span> <span style="color: #f5deb3;">[]</span>     str <span style="color: #268bd2;">=</span> showString <span style="color: #2aa198;">"{}"</span> str
<span style="color: #268bd2;">showSet</span> <span style="color: #f5deb3;">(</span>x<span style="color: #b58900;">:</span>xs<span style="color: #f5deb3;">)</span> str <span style="color: #268bd2;">=</span> showChar <span style="color: #2aa198;">'{'</span> <span style="color: #f5deb3;">(</span>shows x <span style="color: #b58900;">(</span>show1 xs str<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
  <span style="color: #859900; font-weight: bold;">where</span> show1 <span style="color: #f5deb3;">[]</span>     str <span style="color: #268bd2;">=</span> showChar <span style="color: #2aa198;">'}'</span> str
        show1 <span style="color: #f5deb3;">(</span>x<span style="color: #b58900;">:</span>xs<span style="color: #f5deb3;">)</span> str <span style="color: #268bd2;">=</span> showChar <span style="color: #2aa198;">','</span> <span style="color: #f5deb3;">(</span>shows x <span style="color: #b58900;">(</span>show1 xs str<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>

<span style="color: #268bd2;">emptySet</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Set</span> a
<span style="color: #268bd2;">emptySet</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">[]</span>

<span style="color: #268bd2;">isEmpty</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Bool</span>
<span style="color: #268bd2;">isEmpty</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> <span style="color: #b58900;">[]</span><span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">True</span>
<span style="color: #268bd2;">isEmpty</span> <span style="color: #859900; font-weight: bold;">_</span>        <span style="color: #268bd2;">=</span> <span style="color: #b58900;">False</span>

<span style="color: #268bd2;">inSet</span> <span style="color: #268bd2;">::</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Eq</span> a<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=&gt;</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Bool</span>
<span style="color: #268bd2;">inSet</span> x <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> s<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> elem x s

<span style="color: #268bd2;">subSet</span> <span style="color: #268bd2;">::</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Eq</span> a<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=&gt;</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Bool</span>
<span style="color: #268bd2;">subSet</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> <span style="color: #b58900;">[]</span><span style="color: #f5deb3;">)</span>     <span style="color: #859900; font-weight: bold;">_</span>   <span style="color: #268bd2;">=</span> <span style="color: #b58900;">True</span>
<span style="color: #268bd2;">subSet</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> <span style="color: #b58900;">(</span>x<span style="color: #b58900;">:</span>xs<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span> set <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">(</span>inSet x set<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">&amp;&amp;</span> subSet <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> xs<span style="color: #f5deb3;">)</span> set

<span style="color: #268bd2;">insertSet</span> <span style="color: #268bd2;">::</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Eq</span> a<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=&gt;</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a
<span style="color: #268bd2;">insertSet</span> x <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> ys<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">|</span> inSet x <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> ys<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Set</span> ys
                     <span style="color: #268bd2;">|</span> otherwise        <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">(</span>x<span style="color: #b58900;">:</span>ys<span style="color: #f5deb3;">)</span>

<span style="color: #268bd2;">deleteSet</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Eq</span> a <span style="color: #268bd2;">=&gt;</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a
<span style="color: #268bd2;">deleteSet</span> x <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> xs<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">(</span>delete x xs<span style="color: #f5deb3;">)</span>

<span style="color: #268bd2;">list2set</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Eq</span> a <span style="color: #268bd2;">=&gt;</span> <span style="color: #f5deb3;">[</span>a<span style="color: #f5deb3;">]</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a
<span style="color: #268bd2;">list2set</span> <span style="color: #f5deb3;">[]</span>     <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">[]</span>
<span style="color: #268bd2;">list2set</span> <span style="color: #f5deb3;">(</span>x<span style="color: #b58900;">:</span>xs<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> insertSet x <span style="color: #f5deb3;">(</span>list2set xs<span style="color: #f5deb3;">)</span>

<span style="color: #268bd2;">powerSet</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Eq</span> a <span style="color: #268bd2;">=&gt;</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> a<span style="color: #f5deb3;">)</span>
<span style="color: #268bd2;">powerSet</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> xs<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">(</span>map <span style="color: #b58900;">(</span><span style="color: #268bd2;">\</span>xs <span style="color: #268bd2;">-&gt;</span> <span style="color: #268bd2;">(</span><span style="color: #b58900;">Set</span> xs<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>powerList xs<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>

<span style="color: #268bd2;">powerList</span> <span style="color: #268bd2;">::</span> <span style="color: #f5deb3;">[</span>a<span style="color: #f5deb3;">]</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">[</span>a<span style="color: #b58900;">]</span><span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">powerList</span> <span style="color: #f5deb3;">[]</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">[</span><span style="color: #b58900;">[]</span><span style="color: #f5deb3;">]</span>
<span style="color: #268bd2;">powerList</span> <span style="color: #f5deb3;">(</span>x<span style="color: #b58900;">:</span>xs<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> <span style="color: #f5deb3;">(</span>powerList xs<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">++</span> <span style="color: #f5deb3;">(</span>map <span style="color: #b58900;">(</span>x<span style="color: #b58900;">:</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>powerList xs<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>

<span style="color: #268bd2;">takeSet</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Eq</span> a <span style="color: #268bd2;">=&gt;</span> <span style="color: #b58900;">Int</span> <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Set</span> a
<span style="color: #268bd2;">takeSet</span> n <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> xs<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">=</span> <span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">(</span>take n xs<span style="color: #f5deb3;">)</span>
</pre>
</div>

<p>
<code>(!!!)</code> is analogous to List's <code>(!!)</code> operator for zero-based subscript look-up.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #f5deb3;">(</span><span style="color: #268bd2;">!!!</span><span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">::</span> <span style="color: #b58900;">Eq</span> a <span style="color: #268bd2;">=&gt;</span> <span style="color: #b58900;">Set</span> a <span style="color: #268bd2;">-&gt;</span> <span style="color: #b58900;">Int</span> <span style="color: #268bd2;">-&gt;</span> a
<span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> xs<span style="color: #f5deb3;">)</span> <span style="color: #268bd2;">!!!</span> n <span style="color: #268bd2;">=</span> xs <span style="color: #268bd2;">!!</span> n
</pre>
</div>
</div>

<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="todo TODO">TODO</span> Review and Note the different ways to declare types in Haskell</h4>
<div class="outline-text-4" id="text-2-3-1">
</div><ul class="org-ul"><li><a id="sec-2-3-1-1" name="sec-2-3-1-1"></a>type<br ></li>
