books/haskell-math/ch4.org
** Set Equality

   Now we can compare Sets ignoring order:

   #+BEGIN_SRC haskell :tangle no
   Set [2, 3, 1] == Set [1, 2, 3]   -- True
   #+END_SRC

   The =Eq= =instance= declaration declares equality in terms of sub-sets:

   #+BEGIN_SRC haskell :tangle no
     instance Eq a => Eq (Set a) where
       set1 == set2 = subSet set1 set2 && subSet set2 set1
   #+END_SRC

   So, two sets are equal iff they are subsets of one another.
