books/haskell-math/ch4.html
<li><a id="sec-2-3-1-2" name="sec-2-3-1-2"></a>newtype<br ></li>
<li><a id="sec-2-3-1-3" name="sec-2-3-1-3"></a>data<br ></li></ul>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Set Equality</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Now we can compare Sets ignoring order:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">[</span>2, 3, 1<span style="color: #f5deb3;">]</span> <span style="color: #268bd2;">==</span> <span style="color: #b58900;">Set</span> <span style="color: #f5deb3;">[</span>1, 2, 3<span style="color: #f5deb3;">]</span>   <span style="color: #586e75;">-- </span><span style="color: #586e75;">True</span>
</pre>
</div>

<p>
The <code>Eq</code> <code>instance</code> declaration declares equality in terms of sub-sets:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #859900; font-weight: bold;">instance</span> <span style="color: #b58900;">Eq</span> a <span style="color: #268bd2;">=&gt;</span> <span style="color: #b58900;">Eq</span> <span style="color: #f5deb3;">(</span><span style="color: #b58900;">Set</span> a<span style="color: #f5deb3;">)</span> <span style="color: #859900; font-weight: bold;">where</span>
  set1 <span style="color: #268bd2;">==</span> set2 <span style="color: #268bd2;">=</span> subSet set1 set2 <span style="color: #268bd2;">&amp;&amp;</span> subSet set2 set1
</pre>
</div>

<p>
So, two sets are equal iff they are subsets of one another.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
